splice> AUTOCOMMIT OFF;
splice> -- MODULE DML053

-- SQL Test Suite, V6.0, Interactive SQL, dml053.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION HU
   set schema HU;
0 rows inserted/updated/deleted
splice> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
HU                                                                                                                              
splice> -- RERUN if USER value does not match preceding AUTHORIZATION comment

-- date_time print

-- TEST:0233 Table as multiset of rows - INSERT duplicate VALUES()!
 
-- setup
     INSERT INTO TEMP_S
            VALUES('E1',11,'Deale');
1 row inserted/updated/deleted
splice> -- PASS:0233 If 1 row is inserted?

     INSERT INTO TEMP_S
            VALUES('E1',11,'Deale');
1 row inserted/updated/deleted
splice> -- PASS:0233 If 1 row is inserted?

--O     SELECT COUNT(*)
     SELECT empnum
                FROM TEMP_S
                WHERE EMPNUM='E1' AND GRADE=11 AND CITY='Deale';
EMP&
----
E1  
E1  
splice> -- PASS:0233 If count = 2?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0233 <<< END TEST
-- *************************************************////END-OF-MODULE
;
splice> 
