splice> --
--   Licensed to the Apache Software Foundation (ASF) under one or more
--   contributor license agreements.  See the NOTICE file distributed with
--   this work for additional information regarding copyright ownership.
--   The ASF licenses this file to You under the Apache License, Version 2.0
--   (the "License"); you may not use this file except in compliance with
--   the License.  You may obtain a copy of the License at
--
--      http://www.apache.org/licenses/LICENSE-2.0
--
--   Unless required by applicable law or agreed to in writing, software
--   distributed under the License is distributed on an "AS IS" BASIS,
--   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
--   See the License for the specific language governing permissions and
--   limitations under the License.
--
autocommit off;
splice> create table t1 (c1 int primary key, c2 int);
0 rows inserted/updated/deleted
splice> insert into t1 values 
    (1, 1), (2, 2), (3, 3), (4, 4), (5, 5), 
    (6, 6), (7, 7), (8, 8), (9, 9), (10, 10);
10 rows inserted/updated/deleted
splice> get scroll insensitive cursor sc1 as 'SELECT * FROM t1 FOR UPDATE';
splice> next sc1;
C1         |C2         
-----------------------
1          |1          
splice> next sc1;
C1         |C2         
-----------------------
2          |2          
splice> -- update row nr. 2 after positioning with next
update t1 set c2 = c1 + 20 where current of sc1;
1 row inserted/updated/deleted
splice> absolute 5 sc1;
C1         |C2         
-----------------------
5          |5          
splice> -- update row nr. 5 after positioning with absolute
update t1 set c2 = c1 + 20 where current of sc1;
1 row inserted/updated/deleted
splice> relative 2 sc1;
C1         |C2         
-----------------------
7          |7          
splice> -- update row nr. 7 after positioning with relative
update t1 set c2 = c1 + 20 where current of sc1;
1 row inserted/updated/deleted
splice> previous sc1;
C1         |C2         
-----------------------
6          |6          
splice> -- update row nr. 6 after positioning with previous
update t1 set c2 = c1 + 20 where current of sc1;
1 row inserted/updated/deleted
splice> relative -1 sc1;
C1         |C2         
-----------------------
5          |25         
splice> last sc1;
C1         |C2         
-----------------------
10         |10         
splice> -- update row nr. 10 after positioning with last
update t1 set c2 = c1 + 20 where current of sc1;
1 row inserted/updated/deleted
splice> after last sc1;
No current row
splice> -- update when positioned after last should cause an error
update t1 set c2 = c1 + 20 where current of sc1;
ERROR 24000: Invalid cursor state - no current row.
splice> first sc1;
C1         |C2         
-----------------------
1          |1          
splice> -- update row nr. 1 after positioning with first
update t1 set c2 = c1 + 20 where current of sc1;
1 row inserted/updated/deleted
splice> before first sc1;
No current row
splice> -- update when positioned before first should cause an error
update t1 set c2 = c1 + 20 where current of sc1;
ERROR 24000: Invalid cursor state - no current row.
splice> close sc1;
splice> commit;
splice> -- check that row where correctly updated
select * from t1;
C1         |C2         
-----------------------
1          |21         
2          |22         
3          |3          
4          |4          
5          |25         
6          |26         
7          |27         
8          |8          
9          |9          
10         |30         
splice> get scroll insensitive cursor sc1 as 'SELECT * FROM t1 FOR UPDATE';
splice> next sc1;
C1         |C2         
-----------------------
1          |21         
splice> next sc1;
C1         |C2         
-----------------------
2          |22         
splice> -- delete row nr. 2 after positioning with next
delete from t1 where current of sc1;
1 row inserted/updated/deleted
splice> absolute 5 sc1;
C1         |C2         
-----------------------
5          |25         
splice> -- delete row nr. 5 after positioning with absolute
delete from t1 where current of sc1;
1 row inserted/updated/deleted
splice> relative 2 sc1;
C1         |C2         
-----------------------
7          |27         
splice> -- delete row nr. 7 after positioning with relative
delete from t1 where current of sc1;
1 row inserted/updated/deleted
splice> previous sc1;
C1         |C2         
-----------------------
6          |26         
splice> -- delete row nr. 6 after positioning with previous
delete from t1 where current of sc1;
1 row inserted/updated/deleted
splice> relative -1 sc1;
C1         |C2         
-----------------------
NULL       |NULL       
splice> last sc1;
C1         |C2         
-----------------------
10         |30         
splice> -- delete row nr. 10 after positioning with last
delete from t1 where current of sc1;
1 row inserted/updated/deleted
splice> after last sc1;
No current row
splice> -- delete when positioned after last should cause an error
delete from t1 where current of sc1;
ERROR 24000: Invalid cursor state - no current row.
splice> first sc1;
C1         |C2         
-----------------------
1          |21         
splice> -- delete row nr. 1 after positioning with first
delete from t1 where current of sc1;
1 row inserted/updated/deleted
splice> before first sc1;
No current row
splice> -- delete when positioned before first should cause an error
delete from t1 where current of sc1;
ERROR 24000: Invalid cursor state - no current row.
splice> close sc1;
splice> commit;
splice> -- check that row where correctly updated
select * from t1;
C1         |C2         
-----------------------
3          |3          
4          |4          
8          |8          
9          |9          
splice> 
