splice> AUTOCOMMIT OFF;
splice> -- MODULE  YTS796  

-- SQL Test Suite, V6.0, Interactive SQL, yts796.sql
-- 59-byte ID
-- TEd Version #

-- AUTHORIZATION CTS1
   set schema CTS1;
0 rows inserted/updated/deleted
splice> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
CTS1                                                                                                                            
splice> -- RERUN if USER value does not match preceding AUTHORIZATION comment
   ROLLBACK WORK;
splice> -- date_time print

-- TEST:7530 <scalar subquery> as first operand in <comp pred>!

--O   SELECT EMPNAME FROM STAFF WHERE
--O    (SELECT EMPNUM FROM WORKS WHERE PNUM = 'P3')
   SELECT EMPNAME FROM HU.STAFF WHERE
    (SELECT EMPNUM FROM HU.WORKS WHERE PNUM = 'P3')
     = EMPNUM;
EMPNAME             
--------------------
Alice               
splice> -- PASS:7530 If empname = 'Alice'?

--O   SELECT EMPNAME FROM STAFF WHERE 
--O     (SELECT EMPNUM FROM WORKS WHERE PNUM = 'P4')
   SELECT EMPNAME FROM HU.STAFF WHERE 
     (SELECT EMPNUM FROM HU.WORKS WHERE PNUM = 'P4')
     = EMPNUM;
ERROR 21000: Scalar subquery is only allowed to return a single row.
splice> -- PASS:7530 If ERROR - cardinality violation?

   ROLLBACK WORK;
splice> -- END TEST >>> 7530 <<< END TEST
-- *********************************************
-- *************************************************////END-OF-MODULE
;
splice> 
