splice> --
--   Licensed to the Apache Software Foundation (ASF) under one or more
--   contributor license agreements.  See the NOTICE file distributed with
--   this work for additional information regarding copyright ownership.
--   The ASF licenses this file to You under the Apache License, Version 2.0
--   (the "License"); you may not use this file except in compliance with
--   the License.  You may obtain a copy of the License at
--
--      http://www.apache.org/licenses/LICENSE-2.0
--
--   Unless required by applicable law or agreed to in writing, software
--   distributed under the License is distributed on an "AS IS" BASIS,
--   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
--   See the License for the specific language governing permissions and
--   limitations under the License.
--
driver 'org.apache.derby.jdbc.ClientDriver';
splice> --Bug 4632  Make the db italian to make sure string selects  are working
connect 'testsplice;create=true;territory=it' USER 'dbadmin' PASSWORD 'dbadmin';
splice(CONNECTION1)> connect 'testsplice' USER 'dbadmin' PASSWORD 'dbadbmin';
splice(CONNECTION2)> -- this is a comment, a comment in front of a select should not cause an error
select * from sys.systables where 1=0;
TABLEID                             |TABLENAME                                                                                                                       |&|SCHEMAID                            |&
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
splice(CONNECTION2)> -- this is a comment, a comment in front of a values clauses should not cause an error
values(1);
1          
-----------
1          
splice(CONNECTION2)> -- Try some URL attributes
disconnect all;
splice> connect 'testsplice2;create=true' USER 'dbadmin' PASSWORD 'dbadbmin';
splice> select * from APP.notthere;
ERROR 42X05: Table/View 'APP.NOTTHERE' does not exist.
splice> -- examples from the docs

connect 'testsplice2;create=true;user=judy;password=judy';
splice(CONNECTION1)> connect './testsplice2;user=judy;password=judy';
splice(CONNECTION2)> connect 'toursDB';
ERROR 08004: The connection was refused because the database toursDB was not found.
splice(CONNECTION2)> connect 'toursDB' USER 'dbadmin' PASSWORD 'dbadbmin';
ERROR 08004: The connection was refused because the database toursDB was not found.
splice(CONNECTION2)> connect 'wombat' USER 'APP' PASSWORD 'APP';
splice(CONNECTION3)> connect  'testsplice2;create=true;user=usr;password=pwd';
splice(CONNECTION4)> connect 'testsplice2;upgrade=true;user=usr;password=pwd';
splice(CONNECTION5)> connect 'testsplice2;shutdown=true;user=usr;password=pwd';
ERROR 08006: DERBY SQL error: SQLCODE: -1, SQLSTATE: 08006, SQLERRMC: Database 'testsplice2' shutdown.
splice(CONNECTION5)> connect './testsplice2;create=true;user=usr;password=pwd';
splice(CONNECTION6)> connect './testsplice2;create=true;user=usr;password=pwd';
splice(CONNECTION7)> connect  'testsplice2;create=true;user=usr;password=pwd';
splice(CONNECTION8)> connect 'testsplice2;upgrade=true;user=usr;password=pwd';
splice(CONNECTION9)> connect 'testsplice2;shutdown=true;user=usr;password=pwd';
ERROR 08006: DERBY SQL error: SQLCODE: -1, SQLSTATE: 08006, SQLERRMC: Database 'testsplice2' shutdown.
splice(CONNECTION9)> -- retrieveMessageText Testing
connect 'testsplice2;create=true;user=usr;password=pwd;retrieveMessageText=false';
splice(CONNECTION10)> -- Should not get message text
select * from APP.notthere;
ERROR 42X05: DERBY SQL error: SQLCODE: -1, SQLSTATE: 42X05, SQLERRMC: APP.NOTTHERE42X05
splice(CONNECTION10)> connect 'testsplice2;create=true;user=usr;password=pwd;retrieveMessageText=true';
splice(CONNECTION11)> -- Should see message text
select * from APP.notthere;
ERROR 42X05: Table/View 'APP.NOTTHERE' does not exist.
splice(CONNECTION11)> -- just user security mechanism
connect 'testsplice2;create=true;user=usr;retrieveMessageText=true';
splice(CONNECTION12)> connect 'wombat' USER 'APP';
splice(CONNECTION13)> disconnect all;
splice> 
