Testing various splice connections and comments in front of selects
org.apache.derby.tools.splice xxxFILTERED_TESTSpliceSOURCExxx
splice> --
-----   Licensed to the Apache Software Foundation (ASF) under one or more
-----   contributor license agreements.  See the NOTICE file distributed with
-----   this work for additional information regarding copyright ownership.
-----   The ASF licenses this file to You under the Apache License, Version 2.0
-----   (the "License"); you may not use this file except in compliance with
-----   the License.  You may obtain a copy of the License at
-----
-----      http://www.apache.org/licenses/LICENSE-2.0
-----
-----   Unless required by applicable law or agreed to in writing, software
-----   distributed under the License is distributed on an "AS IS" BASIS,
-----   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
-----   See the License for the specific language governing permissions and
-----   limitations under the License.
-----
driver 'com.ibm.db2.jcc.DB2Driver';
splice> --Bug 4632  Make the db italian to make sure string selects  are working
connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/wombat;create=true;territory=it:retrieveMessagesFromServerOnGetMessage=true;' USER 'dbadmin' PASSWORD 'dbadmin';
splice> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/wombat' USER 'dbadmin' PASSWORD 'dbadbmin';
splice(CONNECTION1)> -- this is a comment, a comment in front of a select should not cause an error
select * from sys.systables where 1=0;
TABLEID |TABLENAME |& |SCHEMAID |&
-----
0 rows selected
splice(CONNECTION1)> -- this is a comment, a comment in front of a values clauses should not cause an error
values(1);
1          
-----
1          
1 row selected
splice(CONNECTION1)> -- Try some URL attributes
disconnect all;
splice> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/junk;create=true:retrieveMessagesFromServerOnGetMessage=true;' USER 'dbadmin' PASSWORD 'dbadbmin';
splice> select * from SPLICE.notthere;
ERROR 42X05: Table/View 'SPLICE.NOTTHERE' does not exist.
splice> -- examples from the docs
connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/wombat;create=true:user=judy;password=judy;retrieveMessagesFromServerOnGetMessage=true;';
splice(CONNECTION1)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/"./wombat":user=judy;password=judy;retrieveMessagesFromServerOnGetMessage=true;';
splice(CONNECTION2)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/toursDB:retrieveMessagesFromServerOnGetMessage=true;';
ERROR (no SQLState): null userid not supported
splice(CONNECTION2)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/toursDB:retrieveMessagesFromServerOnGetMessage=true;' USER 'dbadmin' PASSWORD 'dbadbmin';
ERROR 08004: The application server rejected establishment of the connection.  An attempt was made to access a database, toursDB, which was not found.
splice(CONNECTION2)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/wombat' USER 'SPLICE' PASSWORD 'SPLICE';
splice(CONNECTION3)> connect  'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/my-db-name;create=true:user=usr;password=pwd;retrieveMessagesFromServerOnGetMessage=true;';
splice(CONNECTION4)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/my-db-name;upgrade=true:user=usr;password=pwd;retrieveMessagesFromServerOnGetMessage=true;';
splice(CONNECTION5)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/my-db-name;shutdown=true:user=usr;password=pwd;'
----- Quoted db and attributes
connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/"./my-dbname;create=true":user=usr;password=pwd;';
ERROR 08006: DB2 SQL error: SQLCODE: -1, SQLSTATE: 08006, SQLERRMC: Database 'my-db-name' shutdown.
splice(CONNECTION5)> connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/"./my-dbname;create=true":user=usr;password=pwd;retrieveMessagesFromServerOnGetMessage=true;';
splice(CONNECTION6)> -- with no user
connect 'jdbc:derby:net://xxxFILTERED_HOSTNAMExxx:1527/wombat;create=true:retrieveMessagesFromServerOnGetMessage=true;';
ERROR (no SQLState): null userid not supported
splice(CONNECTION6)> End test
